app/controllers/posts_controller.rb

  def index
    @posts = Post.find :all # well, all published.
  end
---
SELECT * FROM `posts` ORDER BY posts.id DESC LIMIT 1

  def create
    @post = Post.create(params[:post])
    @post.save
---
INSERT INTO `posts` (`updated_at`, `title`, `body`, `excerpt`, `user_id`, `published_at`, `created_at`) VALUES('2009-02-15 05:44:55', 'This is working okay so far', 'I want to write about kitchens. Kitchens are an area of passionate interest to me.\r\n\r\nYou should love your kitchen.', '', NULL, NULL, '2009-02-15 05:44:55')
UPDATE `posts` SET `user_id` = 1, `updated_at` = '2009-02-15 06:38:11' WHERE `id` = 4