app/controllers/posts_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 4)
UPDATE `posts` SET `body` = 'And... I think it did work!', `updated_at` = '2009-02-15 06:42:37' WHERE `id` = 4
---
  def update
    @post = Post.find(params[:id])
    @post.update_attributes!(params[:post])